__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 54, 46)       0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 54, 512)      3427524     input_2[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 45, 300)      1762500     input_1[0][0]                    
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 512)          2099200     time_distributed_1[0][0]         
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 512)          1665024     embedding_1[0][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1024)         0           lstm_3[0][0]                     
                                                                 lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 3)            3075        concatenate_1[0][0]              
==================================================================================================
Total params: 8,957,323
Trainable params: 8,957,323
Non-trainable params: 0
__________________________________________________________________________________________________
