__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 1)            0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 1, 512)       40960       input_3[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 54, 46)       0                                            
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 45, 300)      1762500     input_2[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           embedding_3[0][0]                
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 54, 512)      3427524     input_1[0][0]                    
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 512)          1665024     embedding_2[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      flatten_1[0][0]                  
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 512)          2099200     time_distributed_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1536)         0           lstm_3[0][0]                     
                                                                 dense_1[0][0]                    
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          786944      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            1539        dense_2[0][0]                    
==================================================================================================
Total params: 10,046,347
Trainable params: 10,046,347
Non-trainable params: 0
__________________________________________________________________________________________________
