__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 54, 46)       0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               [(None, 54, 45), (No 0           input_4[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 54, 45, 300)  1762500     lambda_1[0][0]                   
__________________________________________________________________________________________________
embedding_1 (Embedding)         multiple             1762500     input_1[0][0]                    
                                                                 lambda_1[0][1]                   
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1)            0                                            
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 54, 512)      1665024     time_distributed_1[0][0]         
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 1, 512)       40960       input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 54, 812)      0           time_distributed_2[0][0]         
                                                                 embedding_1[1][0]                
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 512)          1665024     embedding_1[0][0]                
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           embedding_2[0][0]                
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 8)            0                                            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 512)          2713600     concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1544)         0           lstm_1[0][0]                     
                                                                 flatten_1[0][0]                  
                                                                 input_3[0][0]                    
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          791040      concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            1539        dense_1[0][0]                    
==================================================================================================
Total params: 6,974,663
Trainable params: 6,974,663
Non-trainable params: 0
__________________________________________________________________________________________________
