__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 54, 46)       0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1)            0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 54, 46, 300)  1762500     input_4[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 45, 300)      1762500     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 1, 512)       40960       input_2[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 54, 1024)     3330048     time_distributed_1[0][0]         
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 1024)         3330048     embedding_1[0][0]                
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           embedding_2[0][0]                
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 8)            0                                            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 1024)         6295552     time_distributed_2[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 2568)         0           bidirectional_1[0][0]            
                                                                 flatten_1[0][0]                  
                                                                 input_3[0][0]                    
                                                                 bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          1315328     concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            1539        dropout_1[0][0]                  
==================================================================================================
Total params: 12,745,927
Trainable params: 12,745,927
Non-trainable params: 0
__________________________________________________________________________________________________
