__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 45, 300)      1762500     input_1[0][0]                    
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 512)          1665024     embedding_1[0][0]                
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 512)          0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1024)         0           lstm_1[0][0]                     
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          524800      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            1539        dense_1[0][0]                    
==================================================================================================
Total params: 3,953,863
Trainable params: 3,953,863
Non-trainable params: 0
__________________________________________________________________________________________________
