__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 45)           0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 7, 7, 512)    0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 45, 300)      1762500     input_1[0][0]                    
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 512)          0           input_3[0][0]                    
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 512)          1665024     embedding_1[0][0]                
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 8)            0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1032)         0           lstm_1[0][0]                     
                                                                 input_2[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          528896      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            1539        dense_2[0][0]                    
==================================================================================================
Total params: 4,220,615
Trainable params: 4,220,615
Non-trainable params: 0
__________________________________________________________________________________________________
